app/Controllers/Admin/MediaController.php

SELECT *
FROM `admins`
WHERE `id` = '1'
 LIMIT 1
---
    public function __construct()
    {
        $this->imageManager = new ImageManager(new Driver());
        $this->adminModel = new AdminModel();
        $this->username = $this->adminModel->where('id', getCurrentAdmin())->first()['name'];