app/Controllers/Admin/PostController.php

SELECT COUNT(*) AS `numrows`
FROM `posts`
SELECT *
FROM `posts`
ORDER BY `title` ASC
 LIMIT 10
---
    public function apiDataTable(): mixed
    {
        $request = $this->request;

        $draw = $request->getVar('draw');
        $start = $request->getVar('start');
        $length = $request->getVar('length');
        $search = $request->getVar('search')['value'];
        $order = $request->getVar('order');
        $columns = $request->getVar('columns');

        // Fix ordering
        $columnIndex = $order[0]['column']; // Column index from DataTable
        $columnOrder = $columns[$columnIndex]['data']; // Column name
        $orderDir = $order[0]['dir']; // ASC or DESC

        // Total records count
        $totalRecords = $this->postsModel->countAllResults();

        // Query for filtered records
        $query = $this->postsModel;

        if (!empty($search)) {
            $query = $query->like('title', $search)
                ->orLike('meta_description', $search);
        }

        $totalFiltered = $query->countAllResults(false);

        // Fetch paginated and ordered data
        $data = $query->orderBy($columnOrder, $orderDir)
            ->findAll($length, $start);