app/Controllers/Admin/PostController.php

SELECT *
FROM `posts`
WHERE `slug` = 't'
 LIMIT 1
---
    public function checkSlugAPI()
    {
        $response = [];

        $requestSlug = makeSlug($this->request->getPost('slug'));

        if (empty($requestSlug)) {
            $response['status'] = FALSE;
            $response['message'] = "Invalid Slug";
            $response['final_slug'] = $requestSlug;
            return $this->response->setJSON($response);
        }

        if ($this->request->getPost()) {


            $result = $this->postsModel->where('slug', $requestSlug)->first();