app/Controllers/Admin/TagsController.php

SELECT `id`, `name`
FROM `tags`
WHERE `name` LIKE '%7%' ESCAPE '!'
 LIMIT 10
---
    public function fetchTags()
    {
        $tagModel = new TagsModel();

        $query = $this->request->getVar('q') ?? '';

        $tags = $tagModel->like('name', $query)
            ->select('id, name')
            ->findAll(10);