app/Helpers/admin_helper.php

SELECT *
FROM `admins`
WHERE `id` = '1'
 LIMIT 1
---
    function getAdminNameById($id)
    {
        $adminModel = new AdminModel();
        $result = $adminModel->where('id', $id)->first();

UPDATE `admins` SET `last_login` = '2024-12-21 05:41:41', `last_login_ip` = '192.168.29.44'
WHERE `id` = '1'
---
    function update_last_login_admin($user_id)
    {
        // Get the instance of CodeIgniter
        $db = \Config\Database::connect();

        // Prepare the data to update
        $data = [
            'last_login' => date('Y-m-d H:i:s'), // Current timestamp
            'last_login_ip' => \Config\Services::request()->getIPAddress() // Get user's IP address
        ];

        $builder = $db->table('admins');

        if ($builder->where('id', $user_id)->update($data)) {

SELECT `name`, `id`
FROM `categories`
---
    function renderCategoryOptions($selected = '')
    {
        $categoryModel = new CategoryModel();
        $data = $categoryModel->select('name, id')->findAll();

SELECT `name`
FROM `categories`
WHERE `id` = '2'
 LIMIT 1
---
    function getCategoryNameById($categoryId)
    {
        $categoryModel = new CategoryModel();
        $data = $categoryModel->select('name')->where('id', $categoryId)->first();