app/Controllers/AuthController.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@admin.com'
 LIMIT 1
---
    public function doLoginAdmin()
    {

        $adminModel = new AdminModel();
        $session = \Config\Services::session();


        if ($this->request->getPost()) {
            $email = $this->request->getPost("email");
            $password = $this->request->getPost("password");

            $result = $adminModel->where("email", $email)->first();