app/Models/SettingModel.php

    public function getSetting($setting_name)
    {
        return $this->where('setting_name', $setting_name)->first();
---
SELECT *
FROM `settings`
WHERE `setting_name` = 'site_name'
 LIMIT 1